AcDbMText.setShowBorders(System.Boolean)
Set the flag controlling mtext border's visibility.
enable:  true means borders will be visible
false means borders will be invisible
Returns:  Acad::ErrorStatus

AcDbMText.showBorders
Get the flag controlling mtext border's visibility.
Returns:  bool

AcDbMText.setContentsRTF(System.Char!System.Runtime.CompilerServices.IsConst*)
This method sets the contents of the AcDbMText object from
the RTF-encoded text string pointed to by RTFString. RTF codes are
translated to MText codes. Fonts, colors, tabs, and indents are
preserved. Bullets and numbered lists are mapped to hanging paragraphs
using the implied setting for tabs and indents.
The conversion uses 24 as the default point size. That is, 24 point
text (RTF \fs48) will have no height override and text with any other
point size will have a height override of that point size divided by 24.
RTFString: Input RTF-encoded string.
Returns: Returns 0 if successful.

AcDbMText.contentsRTF(AcString*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
This method returns an RTF encoded string that is a
translated version of the contents of the AcDbMText object. MText
codes are translated to RTF codes. Fonts, colors, tabs, and indents
are preserved.
The conversion uses 24 as the default point size. That is, text with
no height override will have a point size of 24 and text with a height
override will have a point size of the height override multiplied by 24.
The caller is responsible for freeing the memory used by the
returned string (preferrably by using acutDelString()).